In [287]:
import pandas as pd
biop = pd.read_csv(r'D:\GitHub\Data-Science\Pandas\Exercise1\biopics.csv', encoding='latin-1')
biop.head(2)

,title,site,country,year_release,box_office,director,number_of_subjects,subject,type_of_subject,race_known,subject_race,person_of_color,subject_sex,lead_actor_actress
0,10 Rillington Place,http://www.imdb.com/title/tt0066730/,UK,1971,-,Richard Fleischer,1,John Christie,Criminal,Unknown,NaN,0,Male,Richard Attenborough
1,12 Years a Slave,http://www.imdb.com/title/tt2024544/,US/UK,2013,$56.7M,Steve McQueen,1,Solomon Northup,Other,Known,African American,1,Male,Chiwetel Ejiofor

In [301]:
#Find missing data ==> (NaN - 'not a number' is used to indicate a missing value)
#Get the list of entries with missing value for the column subject race
sub_race = biop["subject_race"]
race_null = pd.isnull(sub_race)
race_null.loc[0:4]

0     True
1    False
2     True
3    False
4     True
Name: subject_race, dtype: bool

In [302]:
sub_race_null = sub_race[race_null]
sub_race_null[0:4]

0    NaN
2    NaN
4    NaN
8    NaN
Name: subject_race, dtype: object

In [303]:
print(len(sub_race_null))

197

In [306]:
#Get the list of entries with valid values for subject race
race_not_null = biop["subject_race"][race_null == False]
race_not_null[0:4]

1    African American
3               White
5      Asian American
6               White
Name: subject_race, dtype: object

In [ ]:
#Calculating mean: the mean() function ignores the rows with NaN entries while calculating the sum and count. 
#mean() function in pandas ignores the missing values.

The dropna() method takes an axis parameter, which indicates whether you would like to drop rows or columns. Specifying axis=0 or axis='index' will drop any rows that have null values, while specifying axis=1 or axis='columns' will drop any columns that have null values.

In [324]:
table_null_rows = biop.dropna(axis=0)
table_null_rows[0:2]

,title,site,country,year_release,box_office,director,number_of_subjects,subject,type_of_subject,race_known,subject_race,person_of_color,subject_sex,lead_actor_actress
1,12 Years a Slave,http://www.imdb.com/title/tt2024544/,US/UK,2013,$56.7M,Steve McQueen,1,Solomon Northup,Other,Known,African American,1,Male,Chiwetel Ejiofor
3,1987,http://www.imdb.com/title/tt2833074/,Canada,2014,-,Ricardo Trogi,1,Ricardo Trogi,Other,Known,White,0,Male,Jean-Carl Boucher

In [330]:
table_null_cols = biop.dropna(axis=1)
table_null_cols[0:2]

,title,site,country,year_release,box_office,director,number_of_subjects,subject,type_of_subject,race_known,person_of_color,subject_sex
0,10 Rillington Place,http://www.imdb.com/title/tt0066730/,UK,1971,-,Richard Fleischer,1,John Christie,Criminal,Unknown,0,Male
1,12 Years a Slave,http://www.imdb.com/title/tt2024544/,US/UK,2013,$56.7M,Steve McQueen,1,Solomon Northup,Other,Known,1,Male

In [331]:
table_null_cols = biop.dropna(axis=0,subset=["subject_race","race_known"])
table_null_cols[0:2]

,title,site,country,year_release,box_office,director,number_of_subjects,subject,type_of_subject,race_known,subject_race,person_of_color,subject_sex,lead_actor_actress
1,12 Years a Slave,http://www.imdb.com/title/tt2024544/,US/UK,2013,$56.7M,Steve McQueen,1,Solomon Northup,Other,Known,African American,1,Male,Chiwetel Ejiofor
3,1987,http://www.imdb.com/title/tt2833074/,Canada,2014,-,Ricardo Trogi,1,Ricardo Trogi,Other,Known,White,0,Male,Jean-Carl Boucher